---
kind: type
id: T:Autodesk.Revit.DB.Visual.ConcreteFinishType
source: html/93bdd9a4-f98d-8e24-3816-b40089161e66.htm
---
# Autodesk.Revit.DB.Visual.ConcreteFinishType

The enumerated type representing the permitted values for the asset property "ConcreteFinish" from the "Concrete" schema.

## Syntax (C#)
```csharp
public enum ConcreteFinishType
```